Revit 2016 API
ViewCropRegionShapeManager Methods
The ViewCropRegionShapeManager type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAnnotationCropShape
 Gets the annotation crop box assigned to the view.
GetCropRegionShape |  Obsolete.
 Gets the crop boundary.
GetCropShape
 Gets the crop boundaries that are curently active.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSplitRegionMaximum
 Returns the proportional location of the maximum boundary of the specified split crop region.
GetSplitRegionMinimum
 Returns the proportional location of the minimum boundary of the specified split crop region.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsCropRegionShapeValid
 Verifies that boundary represents one closed curve loop without self-intersections, consisting of non-zero length straight lines in a plane parallel to the view plane.
RemoveCropRegionShape
 Removes any non-rectangular boundary of the view's crop.
RemoveSplit
 Removes any split applied to the view's crop.
RemoveSplitRegion
 Removes one region in split crop.
SetCropRegionEmptyShape |  Obsolete.
 Sets crop region of empty shape making possible interactive sketching.
SetCropRegionShape |  Obsolete.
 Sets the boundary of the view's crop to the specified shape.
SetCropShape
 Sets the boundary of the view's crop to the specified shape.
SplitRegionHorizontally
 Splits horizontally one region in split crop.
SplitRegionVertically
 Splits vertically one region in split crop.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace